app/controllers/home_controller.rb

  def index
    @shop = Shop.find_by_shopify_domain(@shop_session.url)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = ? LIMIT 1  [["shopify_domain", "letranloc-2.myshopify.com"]]