app/controllers/home_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = ? LIMIT 1  [["shopify_domain", "letranloc-2.myshopify.com"]]
---
  def preferences
    @shop = Shop.find_by_shopify_domain(@shop_session.url)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shops" SET "kandy_api_key" = ?, "kandy_api_secret" = ?, "kandy_phonenumber" = ?, "kandy_username" = ?, "kandy_password" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["kandy_api_key", ""], ["kandy_api_secret", ""], ["kandy_phonenumber", ""], ["kandy_username", ""], ["kandy_password", ""], ["updated_at", "2015-10-05 05:57:21.101911"], ["id", 1]]
---
  def update_preferences
    @shop = Shop.find(params[:shop][:id])
    if @shop.update_attributes(shop_params)

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = ? LIMIT 1  [["shopify_domain", "letranloc-2.myshopify.com"]]
INSERT INTO "templates" ("shop_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["shop_id", 1], ["created_at", "2015-10-05 13:05:27.598929"], ["updated_at", "2015-10-05 13:05:27.598929"]]
---
  def install
    @shop = Shop.find_by_shopify_domain(@shop_session.url)
    @shop.template = Template.new
    @shop.save!