app/controllers/shopify_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = ? LIMIT 1  [["shopify_domain", "letranloc-2.myshopify.com"]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 1]]
---
  def uninstalled
    shop = Shop.find_by_shopify_domain(params[:domain])
    shop.destroy!