app/controllers/sms_controller.rb

SELECT  "templates".* FROM "templates" WHERE "templates"."shop_id" = ? LIMIT 1  [["shop_id", 4]]
---
  def order_creation
    render nothing: true, status: 200
    Thread.new do
      phone = @shop.kandy_phone_number # params[:customer][:default_address][:phone]
      if phone.blank?
        puts 'Unknown phone number' and return
      end

      if send_sms_notify phone, @shop.template.order_creation

SELECT  "templates".* FROM "templates" WHERE "templates"."shop_id" = ? LIMIT 1  [["shop_id", 4]]
---
  def order_update
    render nothing: true, status: 200
    Thread.new do
      phone = params[:customer][:default_address][:phone]
      if phone.blank?
        puts 'Unknown phone number' and return
      end

      if send_sms_notify phone, @shop.template.order_creation

SELECT  "templates".* FROM "templates" WHERE "templates"."shop_id" = ? LIMIT 1  [["shop_id", 4]]
---
  def order_payment
    render nothing: true, status: 200
    Thread.new do
      if @shop.kandy_phone_number.blank?
        puts 'Unknown phone number' and return
      end

      if send_sms_notify @shop.kandy_phone_number, @shop.template.order_payment